cf/Catalogs/Новинки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Новинки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНовинок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Готовность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Готовность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Новинки/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Заполним даты и ответвенных
	
	текДата = ТекущаяДата();
	Для Каждого Строка Из Товары Цикл Если Строка.Ответственный.Пустая() Тогда Строка.Ответственный = ПараметрыСеанса.ТекущийПользователь; КонецЕсли; Если Строка.ДатаДобавления = '00010101' Тогда Строка.ДатаДобавления = текДата; КонецЕсли; КонецЦикла;
	
	// Проверим чтобы товары были уникальны
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НовинкиТовары.Ссылка,
	                      |	НовинкиТовары.Номенклатура,
	                      |	НовинкиТовары.Номенклатура.Артикул КАК Артикул
	                      |ИЗ
	                      |	Справочник.Новинки.Товары КАК НовинкиТовары
	                      |ГДЕ
	                      |	НовинкиТовары.Ссылка <> &Ссылка
	                      |	И НовинкиТовары.Номенклатура В(&Товары)
	                      |	И НовинкиТовары.Ссылка.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Номенклатура"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		ОбщиеФункции.СообщитьТекст(Выборка.Артикул + " " + Строка(Выборка.Номенклатура) + " - такой товар уже есть в новинке " + Строка(Выборка.Ссылка), "Товары[" + Формат(Товары.Найти(Выборка.Номенклатура, "Номенклатура").НомерСтроки - 1, "ЧГ=") + "]", ЭтотОбъект); КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	КодПолученияМассиваОбъектов = "
	|массивОбъектов = пОбъект;
	|";
	ПараметрыФункции = "(Новый Структура(""массивСсылок, Области"", массивОбъектов, Новый Структура(""Поля"")))";
	
	Если 	Товары.Количество() И
			Константы.ИнтеграцияССайтом.Получить() И
			Не API2.ЗаписатьНаборВБуферОбновленияНаСайте(Товары.ВыгрузитьКолонку("Номенклатура"), 
				Новый Структура("Поле, АдресРесурсаСервера, Очередь, ФункцияПолученияОбъекта, КодПолученияМассиваОбъектов, ПараметрыФункцииПолученияОбъекта", 
				"", "/api/products", 25, "ПолучитьТовары", КодПолученияМассиваОбъектов, ПараметрыФункции)) Тогда
			
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
